Revit 2025 API
RevisionVisibility Enumeration
 Determines whether Revision Clouds and Revision Tags will be visible in the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RevisionVisibility
Public Enumeration RevisionVisibility
public enum class RevisionVisibility
type RevisionVisibility
Members
Member name | Value | Description
Hidden | 0 |  Revision Clouds and Revision Tags will not be visible in the project.
CloudAndTagVisible | 1 |  Revision Clouds and Revision Tags will be visible in the project.
TagVisible | 2 |  Revision Tags will be visible in the project but Revision Clouds will not be.
See Also
Reference
Autodesk.Revit.DB Namespace